; $Header: /cag/LEGO/batch/partsmac/800/batch.ini 1.30 2002-04-08 07:23:42-07 fkremser Exp $
;
; DESCRIPTION:
;        Top toolbar for batch review

[GraphicalObject]
Name=batch
PosStyle=BOTTOMMOST
X=0
Y=0
Width=236
Height=40
FrameThickness=1
Activate=0
RC-DLL=LANGUAGE\HLBAT008.JPN

[ToolDescriptor]
1 = BatActual,    STATIC,          hpgwct02.DLL
2 = BatFile,      PUSHBUTTON,      hpgbut02.dll
3 = BatLoad,      PUSHBUTTON,      hpgbut02.dll
4 = BatSave,      PUSHBUTTON,      hpgbut02.dll
5 = BatGroup,     GROUPFRAME,      hpgbut02.dll

6 = Sort,         STATIC,          hpgwct02.DLL
7 = By,           STATIC,          hpgwct02.DLL
8 = SortCriteria, NONEDITCOMBOBOX, hpgwct02.dll
9 = SortGroup,    GROUPFRAME,      hpgbut02.dll

10= AutoStart,    ImageSet,        hpgbut02.dll
11= AutoStop,     PushButton,      hpgbut02.dll
12= AutoPrev,     PushButton,      hpgbut02.dll
13= AutoNext,     PushButton,      hpgbut02.dll
14= RunSave,      PushButton,      hpgbut02.dll
15= RunPurge,     PushButton,      hpgbut02.dll
16= AutoGroup,    GROUPFRAME,      hpgbut02.dll

17= Layout,       StickyButton,    hpgbut02.dll
;18= ReIntegrate,  PushButton,      hpgbut02.dll
18= ReCalibrate,  PushButton,      hpgbut02.dll
19= Option,       PushButton,      hpgbut02.dll

20= PreviewBatch, PUSHBUTTON,      hpgbut02.dll
21= PrintBatch,   PUSHBUTTON,      hpgbut02.dll
22= HelpBatch,    PUSHBUTTON,      hpgbut02.dll
23= ExitBatch,    PUSHBUTTON,      hpgbut02.dll

24= AddButtons,   GROUPFRAME,      hpgbut02.dll

25= GroupBottom,  GROUPFRAME,      hpgbut02.dll


[fontalias]
1=normal|ＭＳ Ｐゴシック,9,normal
2=bold|ＭＳ Ｐゴシック,9,bold

[STATIC BatActual]
x=5
y=5
width=70
height=18
Text1=
BKColor=255,255,255
Enable=1
Dimage=4
Justify=Center
Command=@View.ComboMenu "_Config[1]","BatchFile"
Help=現在のバッチ
Font=normal
FrameThickness=1

[PushButton BatFile]
x=75
y=5
width=20
height=18
Command=@View.ComboMenu "_Config[1]","BatchFile"
ImageList=RBMP.PullDown|RBMP.PullDown|RBMP.PullDown_Disable
Help=前に読み込んだバッチ ファイルから選択。
FrameThickness=1

[PushButton BatLoad]
x=100
y=5
width=38
height=30
Command=BatchLoad
ImageList=RBMP.Batch_Load|RBMP.Batch_Load|RBMP.Batch_LoadDisabled
Help=バッチ ファイル読み込み
FrameThickness=2

[PushButton BatSave]
x=138
y=5
width=38
height=30
Command=BatchSave
ImageList=RBMP.Batch_Save|RBMP.Batch_Save|RBMP.Batch_SaveDisabled
Help=バッチ ファイル保存
FrameThickness=2

[GroupFrame BatGroup]
x=180
y=1
width=2
height=38
FrameThickness=1

[STATIC Sort]
x=186
y=1
width=90
height=13
Text1=表示順
Justify=Left
Font=normal

[NONEDITCOMBOBOX SortCriteria]
x=186
y=14
width=115
height=90
MaxListsize=4
Sorted=0
DefCommand="BatchSort "
TextList="ラン インデックス|サンプル タイプ|メソッド|データ ファイル"
DEFCmdParnumber=1
BKColor=255,255,255
Justify=Center
Help=バッチ レビュー テーブルの表示順を選択してください。
Font=normal
FrameThickness=0

[GroupFrame SortGroup]
x=305
y=1
width=2
height=38
FrameThickness=1

[ImageSet AutoStart]
;x=286
x=347
y=3
width=46
height=17
FrameThickness=1
SetIndex=0
Set0=RBMP.Run_StartDisabled|RBMP.Run_StartDisabledPressed|RBMP.Run_StartDisabled|print "バッチは読み込まれていません!!!"|現在のバッチの自動レビューを開始します。
Set1=RBMP.Run_Start|RBMP.Run_StartPressed|RBMP.Run_StartDisabled|CPBatch.BatchControlEngine 3|現在のバッチの自動レビューを開始するためにはクリック。
Set2=RBMP.Run_StartDisabled|RBMP.Run_StartDisabledPressed|RBMP.Run_StartDisabled||現在のバッチの自動レビューを開始するためにはクリック。
Set3=RBMP.Run_Start|RBMP.Run_StartPressed|RBMP.Run_StartDisabled|CPBatch.BatchControlEngine 3|現在のバッチの自動レビューを開始するためにはクリック。
Set4=RBMP.Run_Pause|RBMP.Run_PausePressed|RBMP.Run_PauseDisabled|CPBatch.BatchControlEngine 1|現在のバッチの自動レビューを中断します。
Set5=RBMP.Run_Resume|RBMP.Run_ResumePressed|RBMP.Run_ResumeDisabled|CPBatch.BatchControlEngine 0|現在のバッチの自動レビューを再開します。
Set6=RBMP.Run_StartDisabled|RBMP.Run_StartDisabledPressed|RBMP.Run_StartDisabled||現在のバッチの自動レビューを開始するためにはクリック。

[PushButton AutoStop]
;x=286
x=347
y=20
width=46
height=17
Help=現在のバッチの自動レビューを停止します。
ImageList=RBMP.Run_Stop|RBMP.Run_Stop|RBMP.Run_StopDisabled
Command=CPBatch.BatchControlEngine 2

[PushButton AutoPrev]
;x=337
x=398
y=3
width=17
height=17
Help=前回の分析からデータを読み込みます。
ImageList=RBMP.Run_Prev|RBMP.Run_Prev|RBMP.Run_PrevDisabled
Command=BatchExecuteRun _BatchRunIndex-1
FrameThickness=1

[PushButton AutoNext]
;x=337
x=398
y=20
width=17
height=17
Help=次回の分析からデータを読み込みます。
ImageList=RBMP.Run_Next|RBMP.Run_Next|RBMP.Run_NextDisabled
Command=BatchExecuteRun _BatchRunIndex+1
FrameThickness=1

[PushButton RunSave]
;x=359
x=420
y=3
width=38
height=17
Help=現在の分析に対する変更をマークしてバッチ ファイルに保存します。
ImageList=RBMP.Chrom_Keep|RBMP.Chrom_Keep|RBMP.Chrom_KeepDisabled
Command=BatchSaveRun _BatchRunIndex
FrameThickness=1

[PushButton RunPurge]
;x=359
x=420
y=20
width=38
height=17
Help=現在の分析に対する変更を解除します。
ImageList=RBMP.Chrom_Purge|RBMP.Chrom_Purge|RBMP.Chrom_PurgeDisabled
Command=BatchPurgeRun _BatchRunIndex
FrameThickness=1

;[PushButton ReIntegrate]
;x=401
;y=5
;width=30
;height=30
;Help=Click to reintegrate all chromatograms on reload.
;ImageList=RBMP.Reintegrate|RBMP.Reintegrate|RBMP.Reintegrate_Disabled
;Command=BatchReintegrate

[PushButton ReCalibrate]
;x=403
x=311
y=5
width=30
height=30
Help=全てのキャリブレーション バッチを使ってキャリブレーション テーブルを更新します。
ImageList=RBMP.Recalibrate|RBMP.Recalibrate|RBMP.Recalibrate_Disabled
Command=BatchRecalibrate

[GroupFrame AutoGroup]
x=461
y=1
width=0
height=36
FrameThickness=0

; keep room for combobox or other options in table view.
; see in batcombo.ini or in batttool.ini for number of pixel!

[StickyButton Layout]
x=829
y=5
width=30
height=30
Help=バッチ テーブルを表示/消去します
ImageList=RBMP.LayComb|RBMP.LayComb0|RBMP.LayComb|RBMP.LayComb0
CmdList=CpBatch.BatchShowToolBar 1| CpBatch.BatchShowToolBar 0
FrameThickness=2

[PushButton Option]
x=860	;must be 766 to show this button on the very left side of a 800 screen
y=5
width=30
height=30
Help=バッチ レビューのオプション ダイアログボックスを表示します。
ImageList=RBMP.Batch_Option|RBMP.Batch_Option|RBMP.Batch_OptionDisabled
Command=BatchDoOptionDialog

[PushButton PreviewBatch]
x=891
y=5
width=30
height=30
Command=BatchDoOutput "SCREEN"
ImageList=RBMP.Batch_Preview|RBMP.Batch_Preview|RBMP.Batch_PreviewDisabled
Help=クリックで、バッチ レポートをプレビューします
FrameThickness=2

[PushButton PrintBatch]
x=921
y=5
width=30
height=30
Command=BatchDoOutput "PRINTER"
ImageList=RBMP.Batch_Print|RBMP.Batch_Print|RBMP.Batch_PrintDisabled
Help=クリックで、バッチ レポートを印刷します
FrameThickness=2

[PushButton HelpBatch]
x=951
y=5
width=30
height=30
Command=CPBatch.Help 10000
ImageList=RBMP.Batch_Help|RBMP.Batch_Help|RBMP.Batch_HelpDisabled
Help=クリックで、ヘルプにアクセスします。
FrameThickness=2

[PushButton ExitBatch]
x=981
y=5
width=30
height=30
Command=BatchExit
ImageList=RBMP.Batch_Exit|RBMP.Batch_Exit|RBMP.Batch_ExitDisabled
Help=クリックで、バッチ レビューを閉じます。
FrameThickness=2

[GroupFrame AddButtons]
x=1015
y=1
width=2
height=38
FrameThickness=1

[GroupFrame GroupBottom]
x=0
y=39
width=2000
height=2
FrameThickness=1

